In [3]:
import pandas as pd
import numpy as np

## Data Ingestion

In [4]:
data= pd.read_csv("data/Placement.csv")

# Top 5 rows

In [4]:
data.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

# Bottom 5 rows

In [5]:
data.tail()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
210,211,M,80.6,Others,82.0,Others,Commerce,77.6,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.0,Others,60.0,Others,Science,72.0,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.0,Others,67.0,Others,Commerce,73.0,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.0,Others,66.0,Others,Commerce,58.0,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.0,Central,58.0,Others,Science,53.0,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

# Random 5 rows

In [7]:
data.sample(5)

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
116,117,M,68.2,Central,72.8,Central,Commerce,66.60,Comm&Mgmt,Yes,96.0,Mkt&Fin,70.85,Placed,300000.0
12,13,F,47.0,Central,55.0,Others,Science,65.00,Comm&Mgmt,No,62.0,Mkt&HR,65.04,Not Placed,NaN
61,62,M,84.2,Central,73.4,Central,Commerce,66.89,Comm&Mgmt,No,61.6,Mkt&Fin,62.48,Placed,300000.0
188,189,M,61.8,Others,47.0,Others,Commerce,54.38,Comm&Mgmt,No,57.0,Mkt&Fin,56.13,Not Placed,NaN
167,168,M,67.9,Others,62.0,Others,Science,67.00,Sci&Tech,Yes,58.1,Mkt&Fin,75.71,Not Placed,NaN

# Data Shape

In [9]:
data.shape

(215, 15)

# Data Information

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

# Checking Null values

In [12]:
data.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

# Conclusion: Only 'salary' column has null values which is 67.

# This is all the numerical description

In [13]:
data.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

# EDA

In [5]:
data.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

# Number of students Placed and Not Placed

In [19]:
data['status'].value_counts()

status
Placed        148
Not Placed     67
Name: count, dtype: int64

# Top 5 highest salary

In [30]:
data['salary'].sort_values(ascending=False).head()

119    940000.0
150    690000.0
177    650000.0
163    500000.0
77     500000.0
Name: salary, dtype: float64

# Data Preprocessing

In [31]:
data.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

### We will drop sl_no column as we have no use of this column

In [8]:
data= data.drop(['sl_no','salary'],axis=1)

In [34]:
data.head(1)

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,M,67.0,Others,91.0,Others,Commerce,58.0,Sci&Tech,No,55.0,Mkt&HR,58.8,Placed

## Encoding categorical columns

In [11]:
categorical_columns= ['gender', 'ssc_b', 'hsc_b','hsc_s','degree_t','workex','specialisation']

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le = LabelEncoder()

In [24]:
for cat in categorical_columns:
    print(data[cat].unique())

['M' 'F']
['Others' 'Central']
['Others' 'Central']
['Commerce' 'Science' 'Arts']
['Sci&Tech' 'Comm&Mgmt' 'Others']
['No' 'Yes']
['Mkt&HR' 'Mkt&Fin']

In [23]:
gender_category= list([data[categorical_columns[0]].unique()])
len(gender_category[0])

2

In [7]:
data['gender'].unique()

array(['M', 'F'], dtype=object)

In [4]:
data['gender']= data['gender'].map({'M': 1, 'F': 0})

In [36]:
data['ssc_b'].unique()

array(['Others', 'Central'], dtype=object)

In [5]:
data['ssc_b']= data['ssc_b'].map({'Others': 1, 'Central': 0})

In [44]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed
1,1,79.33,0,78.33,1,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed
2,1,65.00,0,68.00,0,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed
3,1,56.00,0,52.00,0,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed
4,1,85.80,0,73.60,0,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed

In [39]:
data['hsc_b'].unique()

array(['Others', 'Central'], dtype=object)

In [6]:
data['hsc_b']= data['hsc_b'].map({'Others': 1, 'Central': 0})

In [45]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed
1,1,79.33,0,78.33,1,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed
2,1,65.00,0,68.00,0,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed
3,1,56.00,0,52.00,0,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed
4,1,85.80,0,73.60,0,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed

In [47]:
data['hsc_s'].unique()

array(['Commerce', 'Science', 'Arts'], dtype=object)

In [7]:
data['hsc_s']= data['hsc_s'].map({'Commerce': 0, 'Science': 1, 'Arts': 2})

In [49]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,0,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed
1,1,79.33,0,78.33,1,1,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed
2,1,65.00,0,68.00,0,2,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed
3,1,56.00,0,52.00,0,1,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed
4,1,85.80,0,73.60,0,0,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed

In [50]:
data['degree_t'].unique()

array(['Sci&Tech', 'Comm&Mgmt', 'Others'], dtype=object)

In [8]:
data['degree_t']= data['degree_t'].map({'Sci&Tech': 0, 'Comm&Mgmt': 1, 'Others': 2})

In [52]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,0,58.00,0,No,55.0,Mkt&HR,58.80,Placed
1,1,79.33,0,78.33,1,1,77.48,0,Yes,86.5,Mkt&Fin,66.28,Placed
2,1,65.00,0,68.00,0,2,64.00,1,No,75.0,Mkt&Fin,57.80,Placed
3,1,56.00,0,52.00,0,1,52.00,0,No,66.0,Mkt&HR,59.43,Not Placed
4,1,85.80,0,73.60,0,0,73.30,1,No,96.8,Mkt&Fin,55.50,Placed

In [53]:
data['workex'].unique()

array(['No', 'Yes'], dtype=object)

In [9]:
data['workex']= data['workex'].map({'No': 0, "Yes": 1})

In [55]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,0,58.00,0,0,55.0,Mkt&HR,58.80,Placed
1,1,79.33,0,78.33,1,1,77.48,0,1,86.5,Mkt&Fin,66.28,Placed
2,1,65.00,0,68.00,0,2,64.00,1,0,75.0,Mkt&Fin,57.80,Placed
3,1,56.00,0,52.00,0,1,52.00,0,0,66.0,Mkt&HR,59.43,Not Placed
4,1,85.80,0,73.60,0,0,73.30,1,0,96.8,Mkt&Fin,55.50,Placed

In [56]:
data['specialisation'].unique()

array(['Mkt&HR', 'Mkt&Fin'], dtype=object)

In [10]:
data['specialisation']= data['specialisation'].map({'Mkt&HR': 0, 'Mkt&Fin': 1})

In [58]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,0,58.00,0,0,55.0,0,58.80,Placed
1,1,79.33,0,78.33,1,1,77.48,0,1,86.5,1,66.28,Placed
2,1,65.00,0,68.00,0,2,64.00,1,0,75.0,1,57.80,Placed
3,1,56.00,0,52.00,0,1,52.00,0,0,66.0,0,59.43,Not Placed
4,1,85.80,0,73.60,0,0,73.30,1,0,96.8,1,55.50,Placed

In [59]:
data['status'].unique()

array(['Placed', 'Not Placed'], dtype=object)

In [11]:
data['status']= data['status'].map({'Placed':1, 'Not Placed': 0})

In [61]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,1,67.00,1,91.00,1,0,58.00,0,0,55.0,0,58.80,1
1,1,79.33,0,78.33,1,1,77.48,0,1,86.5,1,66.28,1
2,1,65.00,0,68.00,0,2,64.00,1,0,75.0,1,57.80,1
3,1,56.00,0,52.00,0,1,52.00,0,0,66.0,0,59.43,0
4,1,85.80,0,73.60,0,0,73.30,1,0,96.8,1,55.50,1

### Storing Independent Variables as x and Dependent Variables as y

In [12]:
x= data.drop('status', axis= 1)
y= data['status']

In [65]:
x.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p
0,1,67.00,1,91.00,1,0,58.00,0,0,55.0,0,58.80
1,1,79.33,0,78.33,1,1,77.48,0,1,86.5,1,66.28
2,1,65.00,0,68.00,0,2,64.00,1,0,75.0,1,57.80
3,1,56.00,0,52.00,0,1,52.00,0,0,66.0,0,59.43
4,1,85.80,0,73.60,0,0,73.30,1,0,96.8,1,55.50

In [66]:
y.head()

0    1
1    1
2    1
3    0
4    1
Name: status, dtype: int64

## Spliting into training and testing dataset

In [67]:
from sklearn.model_selection import train_test_split

In [69]:
x_train, x_test, y_train, y_test= train_test_split(x, y,test_size= 0.20, random_state= 50)

## Model Training

In [20]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import VotingClassifier
from sklearn.model_selection import cross_val_score

In [17]:
lr= LogisticRegression()
dt= DecisionTreeClassifier()
knn= KNeighborsClassifier()

In [18]:
estimators= [('LOG', lr), ('DT', dt),('KNN', knn)]

In [19]:
VC= VotingClassifier(estimators=estimators, voting='hard')

In [27]:
model_accuracy= (round(np.mean(cross_val_score(VC,x,y, scoring='accuracy', cv= 10)),2)*100)

d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
d:\CampusPlacement\env\lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

## Logging

In [33]:
import logging
import os
from datetime import datetime
import sys

In [29]:
datetime.now()

datetime.datetime(2024, 1, 3, 2, 24, 24, 394794)

In [30]:
f"{datetime.now().strftime('%d_%m_%Y_%H_%M_%S')}.log"

'03_01_2024_02_25_08.log'

In [31]:
os.path.join(os.getcwd(),'logs')

'd:\\CampusPlacement\\notebooks\\logs'

In [34]:
class customexception(Exception):
    def __init__(self,error_message,error_details:sys):
        self.error_message= error_message
        _,_,exc_tb= error_details.exc_info()

        self.lineno= exc_tb.tb_lineno
        self.filename= exc_tb.tb_frame.f_code.co_filename
    def __str__(self):
        return "Error occured in Python filename [{0}] line number [{1}] error message [{2}]".format(
            self.filename,self.lineno, str(self.error_message)
        )